Для выполнения заданий возьмите данные из папки [data](https://drive.google.com/drive/folders/17E4vB5kWr5FNjLKRU4XGoJSVTxn1jkg4?usp=sharing) о продажах. Данные распределены по 4 папкам:
* sales_train.csv - данные о продажах с января 2013 по октябрь 2015.
** date - дата продажы
** date_block_num - номер месяца по порядку следования
** shop_id - идентификатор магазина
** item_id - идентификатор товара
** item_price - цена товара
** item_cnt_day - количество проданного товара одного вида в день

* items.csv - подробная информация о товарах
** item_id - идентификатор товара
** item_name - название товара
** category_id - идентификатор категории товара

* item_categories.csv - подробная информация о категориях товаров
** item_category_id - идентификатор категории товара
** category_name - название категории товара

* shops.csv - подробная информация о магазинах
** shop_id - идентификатор магазина
** shop_name - название магазина

## Задание 1



1.   Найдите топ-10 самых часто покупаемых товаров (не забудьте учесть столбец item_cnt_day).
2.   Оставьте только те из них, которые покупали все три года (2013, 2014, 2015).

In [ ]:
library(dplyr)
sales <- read.csv("sales_train.csv")
fail_sale <- sales[sales$item_cnt_day > 0,]
product <- fail_sale %>% group_by(item_id) %>% summarise(item_cnt_day = sum(item_cnt_day))
head(product[order(product$item_cnt_day, decreasing=TRUE),], n=10)

Attaching package: ‘dplyr’


The following objects are masked from ‘package:stats’:

    filter, lag


The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

   item_id item_cnt_day
1  20949   187660
2   2808    17255
3   3732    16676
4  17717    15830
5   5822    14522
6   3734    11733
7   6675    10315
8   3731    10105
9   1855    10041
10 16787     9255

In [ ]:
date_2013 <- fail_sale[fail_sale$date_block_num >= 0 & fail_sale$date_block_num <= 11,]
date_2014 <- fail_sale[fail_sale$date_block_num >= 12 & fail_sale$date_block_num <= 23,]
date_2015 <- fail_sale[fail_sale$date_block_num >= 24 & fail_sale$date_block_num <= 33,]
valid_date <- date_2013[date_2013$item_id %in% c(date_2014$item_id ,date_2015$item_id ),]
top <- product[product$item_id %in% (valid_date$item_id),]
head(top[order(top$item_cnt_day, decreasing=TRUE),], n = 9)

  item_id item_cnt_day
1 20949   187660
2  2808    17255
3  3732    16676
4 17717    15830
5  5822    14522
6  3734    11733
7  6675    10315
8  1855    10041
9 16787     9255

## Задание 2

При выполнении на pandas не используйте merge().

 

1.   Определите категорию товаров, в которой совершается минимальное число покупок. Выведите айди и название категории.
2.   Определите категорию товаров, в которой совершается максимальное число покупок. Выведите айди и название категории.

In [ ]:
item  <- read.csv("items.csv")
category <- read.csv("item_categories.csv")
names(category)[2] <-'category_id'
merge_sales_and_item <- merge(sales, item, by="item_id")
use_items <- merge(merge_sales_and_item, category, by="category_id")
use_items <- use_items[(use_items$item_cnt_day > 0),]
min_category <- use_items %>% group_by(category_id, item_category_name) %>% summarise(item_cnt_day = sum(item_cnt_day))
tail(min_category[order(min_category$item_cnt_day, decreasing=TRUE ),], n=1)

`summarise()` has grouped output by 'category_id'. You can override using the
`.groups` argument.

  category_id item_category_name            item_cnt_day
1 51           Books - Cognitive literature 1

In [ ]:
max_category <- use_items %>% group_by(category_id, item_category_name) %>% summarise(item_cnt_day = sum(item_cnt_day))
head(max_category[order(max_category$item_cnt_day, decreasing=TRUE ),], n=1)

`summarise()` has grouped output by 'category_id'. You can override using the
`.groups` argument.

  category_id item_category_name item_cnt_day
1 40           Cinema - DVD      634885

## Задание 3



1.   Для категорий из задания 2 найдите среднее количество продаж каждого товара категории в 5 магазинах с наибольшими продажами.
2.   Найдите месяцы с минимальными и максимальными продажами для каждого товара из пункта 1.

In [ ]:
use_categories <- use_items[(use_items$category_id == 51) | (use_items$category_id == 40),]
top5_shops <- use_categories %>% group_by(shop_id) %>% summarise(item_cnt_day = sum(item_cnt_day))
top5_shops <- head(top5_shops[order(top5_shops$item_cnt_day, decreasing=TRUE ),], n=5)
category_sales <- use_categories[use_categories$shop_id %in% (top5_shops$shop_id),]
category_sales %>% group_by(shop_id,item_id) %>% summarise(item_cnt_day = mean(item_cnt_day))

`summarise()` has grouped output by 'shop_id'. You can override using the
`.groups` argument.

      shop_id item_id item_cnt_day
1     25       18     1.000000
2     25       19     1.000000
3     25       30     1.480620
4     25       32     1.263158
5     25       34     1.000000
6     25       35     1.750000
7     25       37     1.000000
8     25       64     1.000000
9     25       67     1.050000
10    25       72     1.000000
11    25       73     1.000000
12    25       75     1.000000
13    25       77     1.196429
14    25       78     1.250000
15    25       79     1.000000
16    25       81     1.000000
17    25       86     1.000000
18    25       88     1.000000
19    25       89     1.000000
20    25       90     1.214286
21    25       95     1.000000
22    25       96     1.000000
23    25       97     1.000000
24    25       98     1.481481
25    25      100     1.000000
26    25      933     1.000000
27    25      934     1.064516
28    25      936     1.000000
29    25      937     1.000000
30    25      941     1.000000
⋮     ⋮       ⋮       ⋮
19505 57      22069   1.000000
19506 57      22070   1.333333
19507 57      22071   1.083333
19508 57      22072   1.433333
19509 57      22074   1.000000
19510 57      22075   1.000000
19511 57      22108   1.000000
19512 57      22114   1.000000
19513 57      22119   1.000000
19514 57      22120   1.000000
19515 57      22121   1.357143
19516 57      22123   1.000000
19517 57      22124   1.000000
19518 57      22126   1.192308
19519 57      22128   1.000000
19520 57      22130   1.000000
19521 57      22132   1.000000
19522 57      22133   1.000000
19523 57      22134   1.250000
19524 57      22136   1.200000
19525 57      22143   1.700000
19526 57      22147   1.000000
19527 57      22148   1.000000
19528 57      22149   1.000000
19529 57      22151   1.142857
19530 57      22152   1.100000
19531 57      22159   1.000000
19532 57      22160   1.000000
19533 57      22162   1.396226
19534 57      22163   1.000000

In [ ]:
#c максимальными продажами
month_sales <- use_items %>% group_by(date_block_num, date, item_id) %>% summarise(item_cnt_day = sum(item_cnt_day))
month_sales_for_top5_shops <- month_sales[month_sales$item_id %in% (category_sales$item_id),]
max_sale_for_item <- month_sales_for_top5_shops %>% group_by(item_id) %>% summarise_if(is.numeric, max)
max_sale_for_item

`summarise()` has grouped output by 'date_block_num', 'date'. You can override
using the `.groups` argument.

     item_id date_block_num item_cnt_day
1     0      20               1
2     2      22               1
3     3      19               1
4     4      20               1
5     5      23               1
6     6      18               1
7     7      23               1
8     8      20               1
9     9      19               1
10   10      24               1
11   11      22               1
12   13      20               1
13   14      23               1
14   15      22               1
15   18      19               1
16   19       0               1
17   20      19               1
18   21      20               1
19   22      27               1
20   23      25               1
21   24      27               1
22   25      19               1
23   26      21               1
24   30      33             118
25   32      33              31
26   34      18               4
27   35      20              25
28   37      23               5
29   43       7               1
30   63       6               2
⋮    ⋮       ⋮              ⋮
4687 22075   12              2
4688 22108    6              1
4689 22114   28              4
4690 22116   11              1
4691 22119   26              2
4692 22120   25              2
4693 22121   10             18
4694 22123   17              3
4695 22124    4              2
4696 22126   19             15
4697 22128   14              1
4698 22129    7              1
4699 22130    2             23
4700 22132   16              3
4701 22133   26              2
4702 22134   14             22
4703 22136   17              3
4704 22141   16              6
4705 22143   22             56
4706 22147   20              3
4707 22148    6              1
4708 22149   13              2
4709 22151    6             31
4710 22152   13              3
4711 22156   12              1
4712 22157    8              1
4713 22159   29              2
4714 22160   17              2
4715 22162   33             33
4716 22163   33              4

In [ ]:
min_sale_for_item <- month_sales_for_top5_shops %>% group_by(item_id) %>% summarise_if(is.numeric, min)
min_sale_for_item

     item_id date_block_num item_cnt_day
1     0      20             1
2     2      19             1
3     3      18             1
4     4      20             1
5     5      23             1
6     6      18             1
7     7      23             1
8     8      19             1
9     9      19             1
10   10      24             1
11   11      22             1
12   13      20             1
13   14      23             1
14   15      22             1
15   18      19             1
16   19       0             1
17   20      19             1
18   21      20             1
19   22      27             1
20   23      25             1
21   24      27             1
22   25      19             1
23   26      21             1
24   30       1             1
25   32       0             1
26   34       0             1
27   35       0             1
28   37       2             1
29   43       0             1
30   63       0             1
⋮    ⋮       ⋮              ⋮
4687 22075    0             1
4688 22108    0             1
4689 22114    3             1
4690 22116    0             1
4691 22119    0             1
4692 22120    3             1
4693 22121    6             1
4694 22123    9             1
4695 22124    0             1
4696 22126    9             1
4697 22128    0             1
4698 22129    0             1
4699 22130    0             1
4700 22132    2             1
4701 22133   13             1
4702 22134    0             1
4703 22136    2             1
4704 22141   13             1
4705 22143   14             1
4706 22147    0             1
4707 22148    5             1
4708 22149    0             1
4709 22151    0             1
4710 22152    2             1
4711 22156    2             1
4712 22157    1             1
4713 22159   28             1
4714 22160    0             1
4715 22162   18             1
4716 22163   31             1

## Задание 4



1.  Для категорий из задания 2 найдите среднюю и медианную цену по категории в пределах каждого месяца.
2.   В каждом году найдите месяцы, в которых средняя цена меньше, чем в предыдущем и следующем месяце.

In [ ]:
month_table_for_category %>% group_by(category_id, date_block_num) %>% summarise(item_price = mean(item_price))

`summarise()` has grouped output by 'category_id'. You can override using the
`.groups` argument.

   category_id date_block_num item_price
1  40           0             244.4742
2  40           1             252.1489
3  40           2             260.6641
4  40           3             254.8437
5  40           4             247.6041
6  40           5             245.8342
7  40           6             236.7503
8  40           7             234.4335
9  40           8             241.7959
10 40           9             247.5179
11 40          10             253.1830
12 40          11             257.7787
13 40          12             252.9500
14 40          13             261.3154
15 40          14             262.3982
16 40          15             268.4337
17 40          16             254.4454
18 40          17             255.2208
19 40          18             257.4106
20 40          19             264.0734
21 40          20             265.3047
22 40          21             263.8743
23 40          22             264.1288
24 40          23             261.9266
25 40          24             263.3718
26 40          25             256.3778
27 40          26             258.2126
28 40          27             281.6108
29 40          28             286.6400
30 40          29             279.0772
31 40          30             273.3118
32 40          31             273.1805
33 40          32             279.3695
34 40          33             281.0384
35 51          18             129.0000

In [ ]:
month_table_for_category %>% group_by(category_id, date_block_num) %>% summarise(item_price = median(item_price))

`summarise()` has grouped output by 'category_id'. You can override using the
`.groups` argument.

   category_id date_block_num item_price
1  40           0             199.00
2  40           1             203.00
3  40           2             231.00
4  40           3             199.00
5  40           4             199.00
6  40           5             199.00
7  40           6             149.00
8  40           7             149.00
9  40           8             198.00
10 40           9             199.00
11 40          10             199.00
12 40          11             237.00
13 40          12             199.00
14 40          13             249.00
15 40          14             251.00
16 40          15             249.00
17 40          16             199.00
18 40          17             199.00
19 40          18             199.00
20 40          19             199.00
21 40          20             240.00
22 40          21             199.00
23 40          22             199.00
24 40          23             199.00
25 40          24             200.78
26 40          25             199.00
27 40          26             169.00
28 40          27             299.00
29 40          28             299.00
30 40          29             249.00
31 40          30             199.00
32 40          31             249.00
33 40          32             249.00
34 40          33             249.00
35 51          18             129.00

In [ ]:
mean_table_for_category <- use_categories %>% group_by(category_id, date_block_num) %>% summarise(item_price = mean(item_price))
mean_table_for_category

`summarise()` has grouped output by 'category_id'. You can override using the
`.groups` argument.

   category_id date_block_num item_price
1  40           0             244.4742
2  40           1             252.1489
3  40           2             260.6641
4  40           3             254.8437
5  40           4             247.6041
6  40           5             245.8342
7  40           6             236.7503
8  40           7             234.4335
9  40           8             241.7959
10 40           9             247.5179
11 40          10             253.1830
12 40          11             257.7787
13 40          12             252.9500
14 40          13             261.3154
15 40          14             262.3982
16 40          15             268.4337
17 40          16             254.4454
18 40          17             255.2208
19 40          18             257.4106
20 40          19             264.0734
21 40          20             265.3047
22 40          21             263.8743
23 40          22             264.1288
24 40          23             261.9266
25 40          24             263.3718
26 40          25             256.3778
27 40          26             258.2126
28 40          27             281.6108
29 40          28             286.6400
30 40          29             279.0772
31 40          30             273.3118
32 40          31             273.1805
33 40          32             279.3695
34 40          33             281.0384
35 51          18             129.0000

In [ ]:
#2013
use_year_2013 <- mean_table_for_category[mean_table_for_category$date_block_num >= 0 & mean_table_for_category$date_block_num <= 11,]
table_for_2013 <- data.frame()
for (i in 2:11){
  if(use_year_2013$item_price[i] < use_year_2013$item_price[i-1] & use_year_2013$item_price[i]<use_year_2013$item_price[i+1]){
     categori_id <- c(use_year_2013$category_id[i])
     item_price <- c(use_year_2013$item_price[i])
     month <- c(use_year_2013$date_block_num[i])
     new_row <- data.frame(Categori_id=categori_id, Item_price = item_price, Month = month)
     table_for_2013 <- rbind(table_for_2013,new_row)
  }
}
table_for_2013

  Categori_id Item_price Month
1 40          234.4335   7

In [ ]:
#2014
use_year_2014 <- mean_table_for_category[mean_table_for_category$date_block_num >= 12 & mean_table_for_category$date_block_num <= 23,]
table_for_2014 <- data.frame()
for (i in 2:11){
  if(use_year_2014$item_price[i] < use_year_2014$item_price[i-1] & use_year_2014$item_price[i]<use_year_2014$item_price[i+1]){
     categori_id <- c(use_year_2014$category_id[i])
     item_price <- c(use_year_2014$item_price[i])
     month <- c(use_year_2014$date_block_num[i])
     new_row <- data.frame(Categori_id=categori_id, Item_price = item_price, Month = month)
     table_for_2014 <- rbind(table_for_2014,new_row)
  }
}
table_for_2014

  Categori_id Item_price Month
1 40          254.4454   16
2 40          263.8743   21

In [ ]:
#2015
use_year_2015 <- mean_table_for_category[mean_table_for_category$date_block_num >= 24 & mean_table_for_category$date_block_num <= 33,]
#use_year_2015
table_for_2015 <- data.frame()
for (i in 2:9){
  if(use_year_2015$item_price[i] < use_year_2015$item_price[i-1] & use_year_2015$item_price[i]<use_year_2015$item_price[i+1]){
     categori_id <- c(use_year_2015$category_id[i])
     item_price <- c(use_year_2015$item_price[i])
     month <- c(use_year_2015$date_block_num[i])
     new_row <- data.frame(Categori_id=categori_id, Item_price = item_price, Month = month)
     table_for_2015 <- rbind(table_for_2015,new_row)
  }
}
table_for_2015

  Categori_id Item_price Month
1 40          256.3778   25
2 40          273.1805   31